package com.kh.Oop.basic;

public class 객체 {
	/*
	  OOP
	  object - oriented - progranmmning
	  컴퓨터 프로그램을 사용할 때 
	  어떤 데이터를 입력받아서 순서대로 처리하고 
	  결과를 출력하는 부품들
	  
	  객체란.
	  데이터와 그 데이터를 처리하는 메서드 함께 묶어놓은 파일
	  클래스 : 객체를 만들기위한 템플릿 또는 설계도
	  처음에 만들때 작성한 파일명과 public class의 파일명이 같아야함
	  파일을 외부에서 사용하고싶다면 첫 글자를 소문자가 아니라 대문자로 작성
	  
	  클래스 에는 필드와 생성자 메서드 
	  필드 : 변수명을 작성하는 공간 
	  속성이나 데이터를 저장한 후 객체의 상태가 나타나기도 함
	  String name;
	  
	  생성자 : 클래스명과 동일하게 이름을 작성해야함 
	          객체를 초기화하는 특별한종류의 메서드 
	          생성자를 작성하지않아도 기본 생성자를 자동으로 제공
	          
	  메서드 : 클래스 내부에 동작이나 활동 상태를 작성하는 공간 
	  ex) [접근제한자] [ 반환타입] [메서드 이름] (매개변수 리스트)
	  		 메서드 이름에서 실행할 내용 작성 
	  		 
	          
	  
	 */
	
	
	
	
	
	
	
	
	
	
	
	
	
}
